/* 
1-й Компонент рендериться на маршрут "/" . Містить в собі Header та обгортає вкладені маршрути з їх відповідними сторінками
Компонент нейм "SharedLayout".
2 Header :"Компонент Header рендерить: 
(НЕ АВТОРИЗОВАНИЙ користувач)
  - Logo - компонент, який відображає логотип застосунку і є клікабельним, переадресовує користувача на головну сторінку (WellcomPage)
  - Navigation - Компонент рендерить блок навігації з маршрутами:
       - /signup  - публічний-обмежений, переадресовує на сторінку SignUpPage
       - /signin - публічний-обмежений, переадресує на сторінку SignInPage
Слід ""підсвічувати"" активну сторінку в навігації, в залежності від того, яка відкрита зараз сторінка в основному контенті
"
(АВТОРИЗОВАНИЙ користувач	)
"Компонент Header рендерить: 
  - Logo - переадресовує користувача на головну сторінку
  - Селект Goals, 
  - Селект Weight
  - UserInfoNav - кнопка (аватарка користувача і його ім'я) для відкриття модалки, що редагує дані про користувача"

3 Logo:Компонент, який відображає логотип застосунку і є клікабельним, переадресовує користувача на головну сторінку - WellcomPage


4 Control Panel :
"- блок Goals (Цілі) - має розмітку іконка або піктограма, що представляє собою панель управління цілями. Заголовок ""Goal"" (Ціль) повідомляє користувачеві, що ця частина панелі стосується встановлення та відстеження цілей.
Блок містить в собі відображення обранної цілі користувача (для приклада, напис ""Lose fat"" (Зниження ваги))  і піктограма випадаючого меню, по кліку на нього повинна відкриватись модалка TargetSelectionModal, що дає можливість змінити поточну обрану ціль."

- Weight (Вага) - має розмітку іконка та заголовок "Weight" (Вага) повідомляє користувачеві, що ця частина панелі стосується зважування та відстеження ваги. Блок містить інформацію про поточну вагу користувача (напис 65 kg) і піктограмма редагування. При натисканні на іконку редагування відкривається модальне вікно СurrentWeightModal, з можливісттю оновлення інформації по поточній вазі.
--------------------
Target Selection
5 TargetSelectionModal :
	"Модальне вікно містить заголовок - ""Target Selection""
Вміст модального вікна:
текст ""The service will adjust your calorie intake to your goal. Please select your target:""
і форма з селектами які скалаються з радіо-кнопок: 
- іконки та підпису ""Lose fat""
- іконки та підпису ""Maintain""
- іконки та підпису ""Gain Muscle""
Компонент містить кнопку Confirm (для відправки інформації на бекенд по обраній цілі)"
-----------------------------
Enter your current weight	
6 СurrentWeightModal :
"Модальне вікно складається з заголовку ""Enter your current weight""
текстового повідомлення -  ""You can record your weight once a day""
тексту - ""Today:"" і відображення поточної дати у форматі - число.міяяць.рік
форми з інпутом в якому розміщен плейсхолдер - ""Enter your weight"" і кнопки Confirm (для відправки оновленної інформації на бекенд)"

7 UserInfoNav :

"Компонент рендерить блок з розміткою фото користувача в якості контенту, або іконкою, якщо таке фото відсутнє та ім'ям користувача.
Клік по даному блоку повинен відрендерити компонент UserInfoModal"

8 UserInfoModal :
"Компонент рендерить модалку з кнопками:
 - EditProfile -  - приватний, переадресовує на сторінку /settings
 - LogoutBtn - компонент який виконує логаут користувача."


9 LogoutBtn :
Компонент рендерить кнопку, по кліку на яку відправляється запит на бек і в результаті видаляється сесія користувача на бекенді. Після успішної відповіді потрібно очистити глобальний стейт в store зі всіма даними, що були у авторизованого користувача.
--------------------
Додаткове завдання
10 LogoutBtn :
"ДОДАТКОВЕ ЗАВДАННЯ!!! 
Компонент рендерить кнопку, яка відкриває модалку з кнопками: 
- Cancel - клік по кнопці закриває модалку 
- Logout - клік по кнопці відправляє запит на бек і в результаті видаляє сесію користувача на бекенді. 
Після успішної відповіді потрібно очистити глобальний стейт в store зі всіма даними, що були у авторизованого користувача. 
Також модалка повинна закриватись по кліку на бекдроп та натисканні на Escape"
--------------------------
НЕ АВТОРИЗОВАНИЙ користувач	

WellcomPage	
11 AuthNav : 
"Головна сторінка, для неавторизованного користувача - маршрут ""/"". 
Сторінка містить:
- Картинку.
- Заголовок, який акцентує на можливостях сервісу щодо встановлення та досягнення цілей - Set Goals and Achieve Them (Встановіть цілі та досягніть їх)
- Підзаголовок.
- Блок навігації з маршрутами:
  - /signup - публічний-обмежений, переадресовує на сторінку SignUpPage
  - /signin - публічний-обмежений, переадресує на сторінку SignInPage
- Блок, що містить інформацію про переваги використання сервісу - Service Benefits (Переваги сервісу)"
------------------------
SignUpPage	
12 SignUpPage :
"Компонент рендериться на маршрут /signup
"

13 SignUpForm :
"Сторінка містить:
- Картинку.
- Заголовок - Sign up
- Підзаголовок - You need to register to use the service
- Форму з першою частиною полів форми та кнопкою Sign Up і елементом навігації Sign in у нижній частині сторінки.
      - кнопка Sign Up - активізує перевірку на валідність введеної користувачем інформації. У разі введення користувачем невалідних значень - візуалізувати це йому у вигляді повідомлення. У разі їх валідності - відображає в формі наступну частину полей форми - 1й крок - кнопка Next; 2й, 3й, 4й крок - кнопки Back & Next,  5й крок - Sign Up
      - кнопка Next - активізує перевірку на валідність введеної користувачем інформації. У разі введення користувачем невалідних значень - візуалізувати це йому у вигляді повідомлення. У разі їх валідності - відображає в формі наступну частину полей форми, а також кнопки Back та Next. На останній сторінці форми реєстрації кнопка Next - реєструє користувача. 
      - кнопка Back - повертає користувача на попередні поля форми, заповнені інформацією, яку ввів користувач до того.

 - елемент навігації Sign in - переадресовує користувача на сторінку SignInPage"
Всі інпути форми валідуються і виводять користувачу відповідну інформацію у випадку, якщо введене значення не валідне
Після реєстрації користувач повинен бути переадресований на сторінку SignInPage. Якщо з бекенда було отримано помилку реєстрації - користувачу необхідно вивести  відповідну інформацію і вигляді нотіфікації 


14 SignUpForm.v2 :
Після реєстрації користувач повинен бути автоматично авторизований і перенаправлений на приватну сторінку (SignUpForm.v2)
 
----------------
SignInPage	
15 ForgotPasswordPage :
"Компонент рендериться на маршрут /forgot-password
"
16 ForgotPasswordForm :
" Сторінка містить:
- Картинку.
- Форму, яка містить:
 - інпут, для вводу ємейлу. 
 - кнопка Send - активізує перевірку на валідність введеної користувачем інформації. У разі введення користувачем невалідних значень - візуалізувати це йому у вигляді повідомлення. У разі їх валідності -  відправляє запит на бекенд на відправку листа користувачу, для відновлення паролю. Якщо з бекенда було отримано помилку відновлення паролю - користувачу необхідно вивести  відповідну інформацію і вигляді нотіфікації  
 - елемент навігації  Sign in в нижній частині сторінки - переадресовує користувача на сторінку SignInPage"

 Після відправки запита на відновлення паролю користувач повинен бути переадресований на сторінку SignInPage. Запит відправляє запит на бекенд на відправку листа користувачу, для відновлення паролю. Якщо з бекенда було отримано помилку відновлення паролю - користувачу необхідно вивести  відповідну інформацію і вигляді нотіфікації 
-------------------------------

АВТОРИЗОВАНИЙ користувач	
"Додаток складається з наступних сторінок:
/main - приватний, переадресовує на головну сторінку з інформацією про здоров'я користувача та прогрес до мети - MainPage
/dashboard - приватний, переадресовує на сторінку з графіками зміни показників - DashboardPage
/diary - приватний, переадресовує на сторінку фіксації кількісті споживаної їжі протягом дня - DiaryPage
/recommented-food - приватний, переадресовує на сторінку зі списком рекомендованих продуктів для користувача - RecommentedFoodPage
/settings - приватний, переадресовує на сторінку ProfileSettingsPage, де користувач зможе переглядати та змінювати свої персональні дані, такі як ім'я, вік, стать, вагу, швідкість втрати ваги тощо. "	
-----------------
MainPage	
17 MainPage :
"Компонент рендериться на маршрут ""/"".
Зверстати головну сторінку (мобільна, планшет та десктопна версії), на якій повинні знаходитись контейнери для блоку:
- заголовок сторінки Today
- елемент навігації On the way to the goal - перенаправляє на сторікну /dashboard 
- блок DailyGoal
- блок  Food
- блок  Water
- блок  Diary
- блок  RecommentedFood
На планшетній та мобільній версіях компоненти повинні бути відображені у вигляді списку, а на десктопній версії - у вигляді сітки."

18 DailyGoal :
"Блок DailyGoal (Щоденна мета) - показує загальну кількість калорій, яку користувач має споживати за день, щоб досягти своєї цілі щодо здоров'я або зниження ваги. І візуалізує блоки:
- Calories (Калорії) - складається з іконки, надпису Calories, та значення, яке встановив юзер - показує мету споживання калорій за день. Користувач має споживати цю кількість калорій або менше, щоб залишатись у межах своєї денної мети.
- Water (Вода) - складається з іконки, надпису Water, та значення, яке встановив юзер -  показує мету споживання води за день, виміряної в мілілітрах (мл). Користувач має випити цю кількість води або більше, щоб досягти своєї денної мети щодо водопиття."

19 Food :
"Блок Food (Розподіл поживних речовин) - надає користувачеві інформацію про розподіл поживних речовин в їжі щодо їхніх денних цілей. Відповідно:
- Сalories (Калорії) - круговий графік, що показує загальний прогрес споживання харчування, виміряного калоріями.
- Carbohydrates (Вуглеводи)- круговий графік, що показує розподіл споживання вуглеводів. ""Goal"" вказує на кількість вуглеводів, яку користувач планує спожити за день. ""Left"" показує залишкову кількість вуглеводів, яку користувач може ще спожити, щоб досягти своєї денної цілі.
- Protein (Білки) - круговий графік, що показує розподіл споживання білків. ""Goal"" вказує на кількість білків, яку користувач планує спожити за день. ""Left"" показує залишкову кількість білків, яку користувач може ще спожити, щоб досягти своєї денної цілі.
- Fat (Жири) - круговий графік, що показує розподіл споживання жирів. ""Goal"" вказує на кількість жирів, яку користувач планує спожити за день. ""Left"" показує залишкову кількість жирів, яку користувач може ще спожити, щоб досягти своєї денної цілі."

20 Water :

"Блок Water (трекер води) - надає інформацію про споживання води користувачем та показує, наскільки він наблизився до своєї денної мети. Відповідно:
- Water (Вода) - візуалізація у вигляді блоку з інформацією, що відсоток води, яку користувач вже спожив за день відносно його денної мети. Наприклад, якщо цей показник дорівнює 70%, це означає, що користувач вже випив 70% від своєї денної мети споживання води.
- Water Consumption (Споживання води) - показує кількість води, яку користувач вже випив протягом дня, виміряної в мілілітрах (мл), left (Залишилось) - показує залишкову кількість води, яку користувач ще може випити, щоб досягти своєї денної мети.
- Add Water Intake (Додати споживання води) - Клік по даному блоку повинен відрендерити компонент AddWaterModal, який дозволяє користувачеві додавати кількість випитої води до своєї денної мети."

21 AddWaterModal :
"Компонент рендерить модальне вікно з розміткою 
- заголовок форми: ""Add Water Intake"" (Додати споживання води).
- назва інпута: ""How much water"" (Скільки води) 
- плейсхолдер в інпуті: ""Enter milliliters"" (Введіть мілілітри) - користувач отримує вказівку, що потрібно ввести кількість випитої води в мілілітрах.
- Confirm (Підтвердити) - компонент, який відправляє на бекенд запит для збереження введеної кількості випитої води.
- Cancel (Скасувати) - компонент закриває модальне вікно без збереження змін."
22 Diary :
"Блок Diary (щоденник): - розділ, де користувач веде записи про свої прийоми їжі. Зкладається з блоків:
Заголовок ""Diary"" і кнопка-посилання - ""See more"", яка перенаправляє на сторінку /diary 
- Breakfast (сніданок):  Цей блок відображає деталі щоденного споживання на сніданок.
- Lunch (обід): Цей блок відображає деталі щоденного споживання на обід.
- Dinner (вечеря): Цей блок дозволяє користувачеві записати свій вечерю.
- Snack (перекус): Цей блок дозволяє користувачеві записати свій перекус.
Кожен блок складається з іконки, заголовку (назва прийому їжі) і якщо прийом їжі вже був внесений користувачем, то відображаємо відповідну інформацію по інгрідієнтах внесених користувачем
Якщо даних по цьому прийому їжі ще нема, то відобразити піктограму кнопку (""+ Record your meal""), яка відкриває модальне вікно RecordDiaryModal

Інформація по нутрієнтах:
- значення ""Carbonohidrates"": містить кількость вуглеводів за цей прийом їжі (наприклад -  60)
- значення ""Protein"": містить кількость білків за цей прийом їжі (наприклад -  40) 
- значення ""Fat"": містить кількость жирів за цей прийом їжі (наприклад -  20)"
23 RecordDiaryModal :
"Модальне вікно, яке дозволяє користувачу додавати нові записи про їжу (прийом їжі) до свого щоденника. Він призначений для реєстрації деталей про їжу, таких як назва продукту або страви, кількість вуглеводів, білків та жирів у продукті або страві.
Заголовок - Record your meal (Записати вашу їжу)
Підзаголовок Breakfast (Сніданок) - що вказує, що зараз користувач збирається записати свій прийом їжі на сніданок.
Форма з полями:
Інпут The name of the product or dish (Назва продукту або страви) - користувач вводить назву продукту або страви, яку він їсть.
Інпут Carbonoh - поле для введення кількості вуглеводів у продукті або страві.
Інпут Protein - поле для введення кількості білків у продукті або страві.
Інпут Fat - поле для введення кількості жирів у продукті або страві.
Кнопка Add more (Додати більше) - кнопка, яка додає ще один набір інпутів (The name of the product or dish, Carbonoh, Protein, Fat ) для вводу інформації ще про один продукт.

- Кнопка Cancel (Скасувати) - кнопка, закриває модальне вікно без збереження даних.
- Кнопка Confirm (Підтвердити) -при натисканні на цю кнопку - відбувається запит на бекенд для збереження цих даних в базі даних.
"
24 RecommentedFood :
"Блок Recommended Food (Рекомендована їжа). Блок, що містить перелік рекомендованих продуктів. Складається з заголовка та 4 карток рекомендованих продуктів ""Food Item"". Кожна карточка складається ось з таких елементів:
- іконка
- назва продукту (наприклад, ""Avocado"").
- міра виміру (наприклад, ""100 g"").
- калорійність (наприклад, ""200 calories"").

Кнопка ""See more"" (Дивитись більше) - при натисканні на цю кнопку відбувається перенаправлення користувача на сторінку Recommended Food."
--------------------------
DashboardPage маршрут /dashboard	
25 DashboardPage :
"Компонент рендерить сторінку зі графіки, які відображають інформацію про вживання калорій, води та зміни ваги протягом певних періодів часу (мобільна, планшет та десктопна версії). Фрагмент допомагає користувачеві відстежувати його харчування, водопиття та зміни ваги протягом певних періодів та аналізувати ці дані для досягнення своїх цілей.
Складається з елементів:
Селектор - Last month, який дозволяє обрати відображення данних за останній місяць, або останній рік. Навпроти селекторта відображається назва місяця, за який відображаються данні, або року.
Графік калорій: 
Заголовок - Calories
Середнє значення - ""Average value: 1700 kg"" - показує середню кількість спожитих кілокалорій за певний період часу, наприклад, за місяць або рік. 
Графік:
 - Вертикальна вісь вказує кількість калорій.
 - Горизонтальна вісь позначає дні або місяці.
 - Лінія на графіку показують рівень споживаних калорій протягом вибраного періоду.
Графік води:
Заголовок - Water
Середнє значення - ""Average value: 1700 ml"" - показує середню кількість спожитої рідини (води) за певний період часу, наприклад, за місяць або рік. 
Графік:
 - Вертикальна вісь вказує об'єм води у літрах.
 - Горизонтальна вісь позначає дні або місяці.
- Лінія на графіку відображають об'єм води, який був вжитий протягом вибраного періоду.
Графік зміни ваги:
Заголовок - Weight
Середнє значення -  Average value: 68 kg - показує середню вагу за певний період часу, наприклад, за місяць або рік. 
Графік:
 - Горизонтальна вісь вказує вагу в кілограмах.
 - Горизонтальна вісь позначає дні або місяці."
 ---------------------
 DiaryPage маршрут /diary	
 26 DiaryPage :
 "Сторінка DiaryPage (щоденник): - розділ, де користувач веде записи про свої прийоми їжі. Зкладається з блоків:
Заголовок ""Diary"" 
Чотирьох розділів:
- Breakfast (сніданок): що вказує, що зараз користувач збирається записати свій прийом їжі на сніданок.
- Lunch (обід): Цей блок відображає деталі щоденного споживання на обід.
- Dinner (вечеря): Цей блок дозволяє користувачеві записати свій вечерю.
- Snack (перекус): Цей блок дозволяє користувачеві записати свій перекус.
Кожен блок складається з іконки, заголовку (назва прийому їжі) і закальної кількості вуглеводів, жирів та білків, які людина прийняла ща цей прийом їжі. Якщо ще не був записаний користувачем, то відображати нулі, наприклад  - Carbonohidrates: 0 Protein: 0 Fat: 0
Якщо прийом їжі вже був внесений користувачем, то відображаємо відповідну інформацію по інгрідієнтах в порядку - Carbonohidrates, Protein, Fat
і піктограму кнопку (""+ Record your meal""), яка відкриває модальне вікно RecordDiaryModal

Інформація по нутрієнтах:
- значення ""Carbonohidrates"": містить кількость вуглеводів за цей прийом їжі (наприклад -  60)
- значення ""Protein"": містить кількость білків за цей прийом їжі (наприклад -  40) 
- значення ""Fat"": містить кількость жирів за цей прийом їжі (наприклад -  20)"
--------------------
RecommendedFoodPage маршрут /recommended-food	
27 RecommendedFoodPage :
"Сторінка  Recommended Food (Рекомендована їжа). Блок, що містить перелік рекомендованих продуктів. Складається з заголовка  Recommended Food, малюнка та 10 карток рекомендованих продуктів ""Food Item"". Кожна карточка складається ось з таких елементів:
- іконка
- назва продукту (наприклад, ""Avocado"").
- міра виміру (наприклад, ""100 g"").
- калорійність (наприклад, ""200 calories"")."
-------------------------
SettingsPage - маршрут /settings	
28 SettingsPage :
"- Cторінка скаладається з заголовка - Profile Settings, картинки та компонента User Information"" для редагування інформації про користувача.
В формі відображається ім'я користувача (наприклад, ""Konstantin""), фото(можливість завантажити нове фото), вік (наприклад, ""34""), стать (чоловіча або жінка), вага, зріст, та можливість обрати рівень фізичної активності. Також до цих елементів форми додати валідацію.
Кнопок ""Cancel"" (Скасувати, дозволяє користувачеві скасувати зроблені зміни та повернутися до попереднього стану налаштувань профілю) та ""Save"" (Зберегти, зберігає внесені зміни в налаштуваннях профілю користувача, відправляючі внесені дані на бекенд)."

------------------------------------
*/